Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.BoundaryLinesIntersect Property
 Boundary lines intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BoundaryLinesIntersect { get; }
Public Shared ReadOnly Property BoundaryLinesIntersect As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BoundaryLinesIntersect {
	FailureDefinitionId^ get ();
}
static member BoundaryLinesIntersect : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace